yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al31e8a.h
#define MASK_DMA1_C0CR_EN        0x01
#define MASK_DMA1_C0CR_TCIE      0x02
#define MASK_DMA1_C0CR_HTIE      0x04
#define MASK_DMA1_C0CR_DIR       0x08
#define MASK_DMA1_C0CR_CIRC      0x10
#define MASK_DMA1_C0CR_MINCDEC   0x20

#define MASK_DMA1_C0SPR_TCIF     0x02
#define MASK_DMA1_C0SPR_HTIF     0x04
#define MASK_DMA1_C0SPR_TSIZE    0x08
#define MASK_DMA1_C0SPR_PL0      0x10
#define MASK_DMA1_C0SPR_PL1      0x20
#define MASK_DMA1_C0SPR_PEND     0x40
#define MASK_DMA1_C0SPR_BUSY     0x80

#define MASK_DMA1_C0NDTR_NDT0    0x01
#define MASK_DMA1_C0NDTR_NDT1    0x02
#define MASK_DMA1_C0NDTR_NDT2    0x04
#define MASK_DMA1_C0NDTR_NDT3    0x08
#define MASK_DMA1_C0NDTR_NDT4    0x10
#define MASK_DMA1_C0NDTR_NDT5    0x20
#define MASK_DMA1_C0NDTR_NDT6    0x40
#define MASK_DMA1_C0NDTR_NDT7    0x80

#define MASK_DMA1_C0PARH_PA8     0x01
#define MASK_DMA1_C0PARH_PA9     0x02
#define MASK_DMA1_C0PARH_PA10    0x04
#define MASK_DMA1_C0PARH_PA11    0x08
#define MASK_DMA1_C0PARH_PA12    0x10
#define MASK_DMA1_C0PARH_PA13    0x20
#define MASK_DMA1_C0PARH_PA14    0x40
#define MASK_DMA1_C0PARH_PA15    0x80

#define MASK_DMA1_C0PARL_PA0     0x01
#define MASK_DMA1_C0PARL_PA1     0x02
#define MASK_DMA1_C0PARL_PA2     0x04
#define MASK_DMA1_C0PARL_PA3     0x08
#define MASK_DMA1_C0PARL_PA4     0x10
#define MASK_DMA1_C0PARL_PA5     0x20
#define MASK_DMA1_C0PARL_PA6     0x40
#define MASK_DMA1_C0PARL_PA7     0x80

#define MASK_DMA1_C0M0ARH_M0A8   0x01
#define MASK_DMA1_C0M0ARH_M0A9   0x02
#define MASK_DMA1_C0M0ARH_M0A10  0x04
#define MASK_DMA1_C0M0ARH_M0A11  0x08
#define MASK_DMA1_C0M0ARH_M0A12  0x10
#define MASK_DMA1_C0M0ARH_M0A13  0x20
#define MASK_DMA1_C0M0ARH_M0A14  0x40
#define MASK_DMA1_C0M0ARH_M0A15  0x80

#define MASK_DMA1_C0M0ARL_M0A0   0x01
#define MASK_DMA1_C0M0ARL_M0A1   0x02
#define MASK_DMA1_C0M0ARL_M0A2   0x04
#define MASK_DMA1_C0M0ARL_M0A3   0x08
#define MASK_DMA1_C0M0ARL_M0A4   0x10
#define MASK_DMA1_C0M0ARL_M0A5   0x20
#define MASK_DMA1_C0M0ARL_M0A6   0x40
#define MASK_DMA1_C0M0ARL_M0A7   0x80

#define MASK_DMA1_C1CR_EN        0x01
#define MASK_DMA1_C1CR_TCIE      0x02
#define MASK_DMA1_C1CR_HTIE      0x04
#define MASK_DMA1_C1CR_DIR       0x08
#define MASK_DMA1_C1CR_CIRC      0x10
#define MASK_DMA1_C1CR_MINCDEC   0x20

#define MASK_DMA1_C1SPR_TCIF     0x02
#define MASK_DMA1_C1SPR_HTIF     0x04
#define MASK_DMA1_C1SPR_TSIZE    0x08
#define MASK_DMA1_C1SPR_PL0      0x10
#define MASK_DMA1_C1SPR_PL1      0x20
#define MASK_DMA1_C1SPR_PEND     0x40
#define MASK_DMA1_C1SPR_BUSY     0x80

#define MASK_DMA1_C1NDTR_NDT0    0x01
#define MASK_DMA1_C1NDTR_NDT1    0x02
#define MASK_DMA1_C1NDTR_NDT2    0x04
#define MASK_DMA1_C1NDTR_NDT3    0x08
#define MASK_DMA1_C1NDTR_NDT4    0x10
#define MASK_DMA1_C1NDTR_NDT5    0x20
#define MASK_DMA1_C1NDTR_NDT6    0x40
#define MASK_DMA1_C1NDTR_NDT7    0x80

#define MASK_DMA1_C1PARH_PA8     0x01
#define MASK_DMA1_C1PARH_PA9     0x02
#define MASK_DMA1_C1PARH_PA10    0x04
#define MASK_DMA1_C1PARH_PA11    0x08
#define MASK_DMA1_C1PARH_PA12    0x10
#define MASK_DMA1_C1PARH_PA13    0x20
#define MASK_DMA1_C1PARH_PA14    0x40
#define MASK_DMA1_C1PARH_PA15    0x80

#define MASK_DMA1_C1PARL_PA0     0x01
#define MASK_DMA1_C1PARL_PA1     0x02
#define MASK_DMA1_C1PARL_PA2     0x04
#define MASK_DMA1_C1PARL_PA3     0x08
#define MASK_DMA1_C1PARL_PA4     0x10
#define MASK_DMA1_C1PARL_PA5     0x20
#define MASK_DMA1_C1PARL_PA6     0x40
#define MASK_DMA1_C1PARL_PA7     0x80

#define MASK_DMA1_C1M0ARH_M0A8   0x01
#define MASK_DMA1_C1M0ARH_M0A9   0x02
#define MASK_DMA1_C1M0ARH_M0A10  0x04
#define MASK_DMA1_C1M0ARH_M0A11  0x08
#define MASK_DMA1_C1M0ARH_M0A12  0x10
#define MASK_DMA1_C1M0ARH_M0A13  0x20
#define MASK_DMA1_C1M0ARH_M0A14  0x40
#define MASK_DMA1_C1M0ARH_M0A15  0x80

#define MASK_DMA1_C1M0ARL_M0A0   0x01
#define MASK_DMA1_C1M0ARL_M0A1   0x02
#define MASK_DMA1_C1M0ARL_M0A2   0x04
#define MASK_DMA1_C1M0ARL_M0A3   0x08
#define MASK_DMA1_C1M0ARL_M0A4   0x10
#define MASK_DMA1_C1M0ARL_M0A5   0x20
#define MASK_DMA1_C1M0ARL_M0A6   0x40
#define MASK_DMA1_C1M0ARL_M0A7   0x80

#define MASK_DMA1_C2CR_EN        0x01
#define MASK_DMA1_C2CR_TCIE      0x02
#define MASK_DMA1_C2CR_HTIE      0x04
#define MASK_DMA1_C2CR_DIR       0x08
#define MASK_DMA1_C2CR_CIRC      0x10
#define MASK_DMA1_C2CR_MINCDEC   0x20

#define MASK_DMA1_C2SPR_TCIF     0x02
#define MASK_DMA1_C2SPR_HTIF     0x04
#define MASK_DMA1_C2SPR_TSIZE    0x08
#define MASK_DMA1_C2SPR_PL0      0x10
#define MASK_DMA1_C2SPR_PL1      0x20
#define MASK_DMA1_C2SPR_PEND     0x40
#define MASK_DMA1_C2SPR_BUSY     0x80

#define MASK_DMA1_C2NDTR_NDT0    0x01
#define MASK_DMA1_C2NDTR_NDT1    0x02
#define MASK_DMA1_C2NDTR_NDT2    0x04
#define MASK_DMA1_C2NDTR_NDT3    0x08
#define MASK_DMA1_C2NDTR_NDT4    0x10
#define MASK_DMA1_C2NDTR_NDT5    0x20
#define MASK_DMA1_C2NDTR_NDT6    0x40
#define MASK_DMA1_C2NDTR_NDT7    0x80

#define MASK_DMA1_C2PARH_PA8     0x01
#define MASK_DMA1_C2PARH_PA9     0x02
#define MASK_DMA1_C2PARH_PA10    0x04
#define MASK_DMA1_C2PARH_PA11    0x08
#define MASK_DMA1_C2PARH_PA12    0x10
#define MASK_DMA1_C2PARH_PA13    0x20
#define MASK_DMA1_C2PARH_PA14    0x40
#define MASK_DMA1_C2PARH_PA15    0x80

#define MASK_DMA1_C2PARL_PA0     0x01
#define MASK_DMA1_C2PARL_PA1     0x02
#define MASK_DMA1_C2PARL_PA2     0x04
#define MASK_DMA1_C2PARL_PA3     0x08
#define MASK_DMA1_C2PARL_PA4     0x10
#define MASK_DMA1_C2PARL_PA5     0x20
#define MASK_DMA1_C2PARL_PA6     0x40
#define MASK_DMA1_C2PARL_PA7     0x80

#define MASK_DMA1_C2M0ARH_M0A8   0x01
#define MASK_DMA1_C2M0ARH_M0A9   0x02
#define MASK_DMA1_C2M0ARH_M0A10  0x04
#define MASK_DMA1_C2M0ARH_M0A11  0x08
#define MASK_DMA1_C2M0ARH_M0A12  0x10
#define MASK_DMA1_C2M0ARH_M0A13  0x20
#define MASK_DMA1_C2M0ARH_M0A14  0x40
#define MASK_DMA1_C2M0ARH_M0A15  0x80

#define MASK_DMA1_C2M0ARL_M0A0   0x01
#define MASK_DMA1_C2M0ARL_M0A1   0x02
#define MASK_DMA1_C2M0ARL_M0A2   0x04
#define MASK_DMA1_C2M0ARL_M0A3   0x08
#define MASK_DMA1_C2M0ARL_M0A4   0x10
#define MASK_DMA1_C2M0ARL_M0A5   0x20
#define MASK_DMA1_C2M0ARL_M0A6   0x40
#define MASK_DMA1_C2M0ARL_M0A7   0x80

#define MASK_DMA1_C3CR_EN        0x01
#define MASK_DMA1_C3CR_TCIE      0x02
#define MASK_DMA1_C3CR_HTIE      0x04
#define MASK_DMA1_C3CR_DIR       0x08
#define MASK_DMA1_C3CR_CIRC      0x10
#define MASK_DMA1_C3CR_MINCDEC   0x20
#define MASK_DMA1_C3CR_MEM       0x40

#define MASK_DMA1_C3SPR_TCIF     0x02
#define MASK_DMA1_C3SPR_HTIF     0x04
#define MASK_DMA1_C3SPR_TSIZE    0x08
#define MASK_DMA1_C3SPR_PL0      0x10
#define MASK_DMA1_C3SPR_PL1      0x20
#define MASK_DMA1_C3SPR_PEND     0x40
#define MASK_DMA1_C3SPR_BUSY     0x80

