yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al31e8a.h
#define I2C1_FREQR_FREQ          I2C1_FREQR_bit.FREQ

#define I2C1_OARL_ADD0           I2C1_OARL_bit.ADD0
#define I2C1_OARL_ADD1           I2C1_OARL_bit.ADD1
#define I2C1_OARL_ADD2           I2C1_OARL_bit.ADD2
#define I2C1_OARL_ADD3           I2C1_OARL_bit.ADD3
#define I2C1_OARL_ADD4           I2C1_OARL_bit.ADD4
#define I2C1_OARL_ADD5           I2C1_OARL_bit.ADD5
#define I2C1_OARL_ADD6           I2C1_OARL_bit.ADD6
#define I2C1_OARL_ADD7           I2C1_OARL_bit.ADD7

#define I2C1_OARH_ADD8           I2C1_OARH_bit.ADD8
#define I2C1_OARH_ADD9           I2C1_OARH_bit.ADD9
#define I2C1_OARH_ADDCONF        I2C1_OARH_bit.ADDCONF
#define I2C1_OARH_ADDMODE        I2C1_OARH_bit.ADDMODE

#define I2C1_OAR2_ENDUAL         I2C1_OAR2_bit.ENDUAL
#define I2C1_OAR2_ADD21          I2C1_OAR2_bit.ADD21
#define I2C1_OAR2_ADD22          I2C1_OAR2_bit.ADD22
#define I2C1_OAR2_ADD23          I2C1_OAR2_bit.ADD23
#define I2C1_OAR2_ADD24          I2C1_OAR2_bit.ADD24
#define I2C1_OAR2_ADD25          I2C1_OAR2_bit.ADD25
#define I2C1_OAR2_ADD26          I2C1_OAR2_bit.ADD26
#define I2C1_OAR2_ADD27          I2C1_OAR2_bit.ADD27

#define I2C1_SR1_SB              I2C1_SR1_bit.SB
#define I2C1_SR1_ADDR            I2C1_SR1_bit.ADDR
#define I2C1_SR1_BTF             I2C1_SR1_bit.BTF
#define I2C1_SR1_ADD10           I2C1_SR1_bit.ADD10
#define I2C1_SR1_STOPF           I2C1_SR1_bit.STOPF
#define I2C1_SR1_RXNE            I2C1_SR1_bit.RXNE
#define I2C1_SR1_TXE             I2C1_SR1_bit.TXE

#define I2C1_SR2_BERR            I2C1_SR2_bit.BERR
#define I2C1_SR2_ARLO            I2C1_SR2_bit.ARLO
#define I2C1_SR2_AF              I2C1_SR2_bit.AF
#define I2C1_SR2_OVR             I2C1_SR2_bit.OVR
#define I2C1_SR2_PECERR          I2C1_SR2_bit.PECERR
#define I2C1_SR2_WUFH            I2C1_SR2_bit.WUFH
#define I2C1_SR2_TIMEOUT         I2C1_SR2_bit.TIMEOUT
#define I2C1_SR2_SMBALERT        I2C1_SR2_bit.SMBALERT

#define I2C1_SR3_MSL             I2C1_SR3_bit.MSL
#define I2C1_SR3_BUSY            I2C1_SR3_bit.BUSY
#define I2C1_SR3_TRA             I2C1_SR3_bit.TRA
#define I2C1_SR3_GENCALL         I2C1_SR3_bit.GENCALL
#define I2C1_SR3_SMBDEFAULT      I2C1_SR3_bit.SMBDEFAULT
#define I2C1_SR3_SMBHOST         I2C1_SR3_bit.SMBHOST

#define I2C1_ITR_ITERREN         I2C1_ITR_bit.ITERREN
#define I2C1_ITR_ITEVTEN         I2C1_ITR_bit.ITEVTEN
#define I2C1_ITR_ITBUFEN         I2C1_ITR_bit.ITBUFEN
#define I2C1_ITR_DMAEN           I2C1_ITR_bit.DMAEN
#define I2C1_ITR_LAST            I2C1_ITR_bit.LAST

#define I2C1_CCRL_CCR0           I2C1_CCRL_bit.CCR0
#define I2C1_CCRL_CCR1           I2C1_CCRL_bit.CCR1
#define I2C1_CCRL_CCR2           I2C1_CCRL_bit.CCR2
#define I2C1_CCRL_CCR3           I2C1_CCRL_bit.CCR3
#define I2C1_CCRL_CCR4           I2C1_CCRL_bit.CCR4
#define I2C1_CCRL_CCR5           I2C1_CCRL_bit.CCR5
#define I2C1_CCRL_CCR6           I2C1_CCRL_bit.CCR6
#define I2C1_CCRL_CCR7           I2C1_CCRL_bit.CCR7

#define I2C1_CCRH_CCR8           I2C1_CCRH_bit.CCR8
#define I2C1_CCRH_CCR9           I2C1_CCRH_bit.CCR9
#define I2C1_CCRH_CCR10          I2C1_CCRH_bit.CCR10
#define I2C1_CCRH_CCR11          I2C1_CCRH_bit.CCR11
#define I2C1_CCRH_DUTY           I2C1_CCRH_bit.DUTY
#define I2C1_CCRH_F_S            I2C1_CCRH_bit.F_S

#define I2C1_TRISER_TRISE        I2C1_TRISER_bit.TRISE

#endif

/*-------------------------------------------------------------------------
 *      I2C1 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_I2C1_CR1_PE         0x01
#define MASK_I2C1_CR1_SMBUS      0x02
#define MASK_I2C1_CR1_SMBTYPE    0x08
#define MASK_I2C1_CR1_ENARP      0x10
#define MASK_I2C1_CR1_ENPEC      0x20
#define MASK_I2C1_CR1_ENGC       0x40
#define MASK_I2C1_CR1_NOSTRETCH  0x80

#define MASK_I2C1_CR2_START      0x01
#define MASK_I2C1_CR2_STOP       0x02
#define MASK_I2C1_CR2_ACK        0x04
#define MASK_I2C1_CR2_POS        0x08
#define MASK_I2C1_CR2_PEC        0x10
#define MASK_I2C1_CR2_ALERT      0x20
#define MASK_I2C1_CR2_SWRST      0x80

#define MASK_I2C1_FREQR_FREQ     0x3F

#define MASK_I2C1_OARL_ADD0      0x01
#define MASK_I2C1_OARL_ADD1      0x02
#define MASK_I2C1_OARL_ADD2      0x04
#define MASK_I2C1_OARL_ADD3      0x08
#define MASK_I2C1_OARL_ADD4      0x10
#define MASK_I2C1_OARL_ADD5      0x20
#define MASK_I2C1_OARL_ADD6      0x40
#define MASK_I2C1_OARL_ADD7      0x80

#define MASK_I2C1_OARH_ADD8      0x02
#define MASK_I2C1_OARH_ADD9      0x04
#define MASK_I2C1_OARH_ADDCONF   0x40
#define MASK_I2C1_OARH_ADDMODE   0x80

#define MASK_I2C1_OAR2_ENDUAL    0x01
#define MASK_I2C1_OAR2_ADD21     0x02
#define MASK_I2C1_OAR2_ADD22     0x04
#define MASK_I2C1_OAR2_ADD23     0x08
#define MASK_I2C1_OAR2_ADD24     0x10
#define MASK_I2C1_OAR2_ADD25     0x20
#define MASK_I2C1_OAR2_ADD26     0x40
#define MASK_I2C1_OAR2_ADD27     0x80

#define MASK_I2C1_SR1_SB         0x01
#define MASK_I2C1_SR1_ADDR       0x02
#define MASK_I2C1_SR1_BTF        0x04
#define MASK_I2C1_SR1_ADD10      0x08
#define MASK_I2C1_SR1_STOPF      0x10
#define MASK_I2C1_SR1_RXNE       0x40
#define MASK_I2C1_SR1_TXE        0x80

#define MASK_I2C1_SR2_BERR       0x01
#define MASK_I2C1_SR2_ARLO       0x02
#define MASK_I2C1_SR2_AF         0x04
#define MASK_I2C1_SR2_OVR        0x08
#define MASK_I2C1_SR2_PECERR     0x10
#define MASK_I2C1_SR2_WUFH       0x20
#define MASK_I2C1_SR2_TIMEOUT    0x40
#define MASK_I2C1_SR2_SMBALERT   0x80

#define MASK_I2C1_SR3_MSL        0x01
#define MASK_I2C1_SR3_BUSY       0x02
#define MASK_I2C1_SR3_TRA        0x04
#define MASK_I2C1_SR3_GENCALL    0x10
#define MASK_I2C1_SR3_SMBDEFAULT 0x20
#define MASK_I2C1_SR3_SMBHOST    0x40

#define MASK_I2C1_ITR_ITERREN    0x01
#define MASK_I2C1_ITR_ITEVTEN    0x02
#define MASK_I2C1_ITR_ITBUFEN    0x04
#define MASK_I2C1_ITR_DMAEN      0x08
#define MASK_I2C1_ITR_LAST       0x10

#define MASK_I2C1_CCRL_CCR0      0x01
#define MASK_I2C1_CCRL_CCR1      0x02
#define MASK_I2C1_CCRL_CCR2      0x04
#define MASK_I2C1_CCRL_CCR3      0x08
#define MASK_I2C1_CCRL_CCR4      0x10
#define MASK_I2C1_CCRL_CCR5      0x20
#define MASK_I2C1_CCRL_CCR6      0x40
#define MASK_I2C1_CCRL_CCR7      0x80

#define MASK_I2C1_CCRH_CCR8      0x01
#define MASK_I2C1_CCRH_CCR9      0x02
#define MASK_I2C1_CCRH_CCR10     0x04
#define MASK_I2C1_CCRH_CCR11     0x08
#define MASK_I2C1_CCRH_DUTY      0x40
#define MASK_I2C1_CCRH_F_S       0x80

#define MASK_I2C1_TRISER_TRISE   0x3F


/*-------------------------------------------------------------------------
 *      USART1 register definitions
 *-----------------------------------------------------------------------*/
/* USART1 status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PE          : 1;
  unsigned char FE          : 1;
  unsigned char NF          : 1;
  unsigned char OR          : 1;
  unsigned char IDLE        : 1;
  unsigned char RXNE        : 1;
  unsigned char TC          : 1;
  unsigned char TXE         : 1;
} __BITS_USART1_SR;
#endif
__IO_REG8_BIT(USART1_SR,   0x5230, __READ, __BITS_USART1_SR);

