yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al31e8a.h
/* TIM5 Capture/Compare mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1S        : 2;
  unsigned char OC1FE       : 1;
  unsigned char OC1PE       : 1;
  unsigned char OC1M        : 3;
} __BITS_TIM5_CCMR1;
#endif
__IO_REG8_BIT(TIM5_CCMR1,  0x5309, __READ_WRITE, __BITS_TIM5_CCMR1);

/* TIM5 Capture/Compare mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC2S        : 2;
  unsigned char OC2FE       : 1;
  unsigned char OC2PE       : 1;
  unsigned char OC2M        : 3;
} __BITS_TIM5_CCMR2;
#endif
__IO_REG8_BIT(TIM5_CCMR2,  0x530A, __READ_WRITE, __BITS_TIM5_CCMR2);

/* TIM5 Capture/Compare enable register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1E        : 1;
  unsigned char CC1P        : 1;
  unsigned char             : 2;
  unsigned char CC2E        : 1;
  unsigned char CC2P        : 1;
} __BITS_TIM5_CCER1;
#endif
__IO_REG8_BIT(TIM5_CCER1,  0x530B, __READ_WRITE, __BITS_TIM5_CCER1);

/* TIM5 counter high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CNT8        : 1;
  unsigned char CNT9        : 1;
  unsigned char CNT10       : 1;
  unsigned char CNT11       : 1;
  unsigned char CNT12       : 1;
  unsigned char CNT13       : 1;
  unsigned char CNT14       : 1;
  unsigned char CNT15       : 1;
} __BITS_TIM5_CNTRH;
#endif
__IO_REG8_BIT(TIM5_CNTRH,  0x530C, __READ_WRITE, __BITS_TIM5_CNTRH);

/* TIM5 counter low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CNT0        : 1;
  unsigned char CNT1        : 1;
  unsigned char CNT2        : 1;
  unsigned char CNT3        : 1;
  unsigned char CNT4        : 1;
  unsigned char CNT5        : 1;
  unsigned char CNT6        : 1;
  unsigned char CNT7        : 1;
} __BITS_TIM5_CNTRL;
#endif
__IO_REG8_BIT(TIM5_CNTRL,  0x530D, __READ_WRITE, __BITS_TIM5_CNTRL);

/* TIM5 prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 3;
} __BITS_TIM5_PSCR;
#endif
__IO_REG8_BIT(TIM5_PSCR,   0x530E, __READ_WRITE, __BITS_TIM5_PSCR);

/* TIM5 Auto-reload register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ARR8        : 1;
  unsigned char ARR9        : 1;
  unsigned char ARR10       : 1;
  unsigned char ARR11       : 1;
  unsigned char ARR12       : 1;
  unsigned char ARR13       : 1;
  unsigned char ARR14       : 1;
  unsigned char ARR15       : 1;
} __BITS_TIM5_ARRH;
#endif
__IO_REG8_BIT(TIM5_ARRH,   0x530F, __READ_WRITE, __BITS_TIM5_ARRH);

/* TIM5 Auto-reload register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ARR0        : 1;
  unsigned char ARR1        : 1;
  unsigned char ARR2        : 1;
  unsigned char ARR3        : 1;
  unsigned char ARR4        : 1;
  unsigned char ARR5        : 1;
  unsigned char ARR6        : 1;
  unsigned char ARR7        : 1;
} __BITS_TIM5_ARRL;
#endif
__IO_REG8_BIT(TIM5_ARRL,   0x5310, __READ_WRITE, __BITS_TIM5_ARRL);

/* TIM5 Capture/Compare register 1 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR18       : 1;
  unsigned char CCR19       : 1;
  unsigned char CCR110      : 1;
  unsigned char CCR111      : 1;
  unsigned char CCR112      : 1;
  unsigned char CCR113      : 1;
  unsigned char CCR114      : 1;
  unsigned char CCR115      : 1;
} __BITS_TIM5_CCR1H;
#endif
__IO_REG8_BIT(TIM5_CCR1H,  0x5311, __READ_WRITE, __BITS_TIM5_CCR1H);

/* TIM5 Capture/Compare register 1 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR10       : 1;
  unsigned char CCR11       : 1;
  unsigned char CCR12       : 1;
  unsigned char CCR13       : 1;
  unsigned char CCR14       : 1;
  unsigned char CCR15       : 1;
  unsigned char CCR16       : 1;
  unsigned char CCR17       : 1;
} __BITS_TIM5_CCR1L;
#endif
__IO_REG8_BIT(TIM5_CCR1L,  0x5312, __READ_WRITE, __BITS_TIM5_CCR1L);

/* TIM5 Capture/Compare register 2 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR28       : 1;
  unsigned char CCR29       : 1;
  unsigned char CCR210      : 1;
  unsigned char CCR211      : 1;
  unsigned char CCR212      : 1;
  unsigned char CCR213      : 1;
  unsigned char CCR214      : 1;
  unsigned char CCR215      : 1;
} __BITS_TIM5_CCR2H;
#endif
__IO_REG8_BIT(TIM5_CCR2H,  0x5313, __READ_WRITE, __BITS_TIM5_CCR2H);

/* TIM5 Capture/Compare register 2 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR10       : 1;
  unsigned char CCR11       : 1;
  unsigned char CCR12       : 1;
  unsigned char CCR13       : 1;
  unsigned char CCR14       : 1;
  unsigned char CCR15       : 1;
  unsigned char CCR16       : 1;
  unsigned char CCR17       : 1;
} __BITS_TIM5_CCR2L;
#endif
__IO_REG8_BIT(TIM5_CCR2L,  0x5314, __READ_WRITE, __BITS_TIM5_CCR2L);

/* TIM5 break register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LOCK        : 2;
  unsigned char OSSI        : 1;
  unsigned char             : 1;
  unsigned char BKE         : 1;
  unsigned char BKP         : 1;
  unsigned char AOE         : 1;
  unsigned char MOE         : 1;
} __BITS_TIM5_BKR;
#endif
__IO_REG8_BIT(TIM5_BKR,    0x5315, __READ_WRITE, __BITS_TIM5_BKR);

/* TIM5 output idle state register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char OIS1        : 1;
  unsigned char             : 1;
  unsigned char OIS2        : 1;
} __BITS_TIM5_OISR;
#endif
__IO_REG8_BIT(TIM5_OISR,   0x5316, __READ_WRITE, __BITS_TIM5_OISR);


/*-------------------------------------------------------------------------
 *      TIM5 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define TIM5_CR1_CEN             TIM5_CR1_bit.CEN
#define TIM5_CR1_UDIS            TIM5_CR1_bit.UDIS
#define TIM5_CR1_URS             TIM5_CR1_bit.URS
#define TIM5_CR1_OPM             TIM5_CR1_bit.OPM
#define TIM5_CR1_DIR             TIM5_CR1_bit.DIR
#define TIM5_CR1_CMS             TIM5_CR1_bit.CMS
#define TIM5_CR1_ARPE            TIM5_CR1_bit.ARPE

#define TIM5_CR2_CCDS            TIM5_CR2_bit.CCDS
#define TIM5_CR2_MMS             TIM5_CR2_bit.MMS
#define TIM5_CR2_TI1S            TIM5_CR2_bit.TI1S

#define TIM5_SMCR_SMS            TIM5_SMCR_bit.SMS
#define TIM5_SMCR_TS             TIM5_SMCR_bit.TS
#define TIM5_SMCR_MSM            TIM5_SMCR_bit.MSM

#define TIM5_ETR_ETF             TIM5_ETR_bit.ETF
#define TIM5_ETR_ETPS            TIM5_ETR_bit.ETPS
#define TIM5_ETR_ECE             TIM5_ETR_bit.ECE
#define TIM5_ETR_ETP             TIM5_ETR_bit.ETP

